In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [7]:
df.loc[0] = ['Allen', '22', '175']
df

    Name Age Height
0  Allen  22    175

In [8]:
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Jack', '28', '170']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [9]:
df['Name']

0    Allen
1      Ted
2     Jack
Name: Name, dtype: object

In [10]:
df['Weight'] = ['75', '80', '70']
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    170     70

In [11]:
df.drop(['Weight'],axis=1) #axis means directions, 0 for row and 1 for column

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [12]:
df # 實際沒有被刪除

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    170     70

In [13]:
df = df.drop(['Weight'],axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [15]:
df.drop(2) #刪除第二列 delete the secong row

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [16]:
df['Height'][1] = 185
df

    Name Age Height
0  Allen  22    175
1    Ted  25    185
2   Jack  28    170

In [17]:
df['Height'] = 180
df

    Name Age  Height
0  Allen  22     180
1    Ted  25     180
2   Jack  28     180

In [19]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '22', '175'],
    ['Ted', '25', '180']
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [20]:
df.append(df2) #一樣不會真的加進去

    Name Age Height
0  Allen  22    180
1    Ted  25    180
2   Jack  28    180
0  Allen  22    175
1    Ted  25    180

In [24]:
df = df.append(df2)
df

    Name Age Height
0  Allen  22    180
1    Ted  25    180
2   Jack  28    180
0  Allen  22    175
1    Ted  25    180
0  Allen  22    175
1    Ted  25    180

In [25]:
df.reset_index(drop=True)

    Name Age Height
0  Allen  22    180
1    Ted  25    180
2   Jack  28    180
3  Allen  22    175
4    Ted  25    180
5  Allen  22    175
6    Ted  25    180